flatPlate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          610;
        startFace       496224;
    }
    right
    {
        type            patch;
        nFaces          416;
        startFace       496834;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          610;
        startFace       497250;
    }
    left
    {
        type            patch;
        nFaces          416;
        startFace       497860;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          540;
        startFace       498276;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          497520;
        startFace       498816;
    }
)

// ************************************************************************* //
